Resources/DigitalWindTunnel/Openfoam_digital_twin_no_building/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (20 0 0)
    (20 10 0)
    (0 10 0)

    (0 0 2.1437)
    (20 0 2.1437)
    (20 10 2.1437)
    (0 10 2.1437)

    (0 0 5)
    (20 0 5)
    (20 10 5)
    (0 10 5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 100 96) simpleGrading (1 1 103.0347)
    hex (4 5 6 7 8 9 10 11) (200 100 28) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (   
            (0 4 7 3)
            (4 8 11 7)
        );
     }

    outlet
    {
        type patch;
        faces
        (   
            (1 2 6 5)
            (5 6 10 9)
        );
     }

    top
    {
        type symmetryPlane;
        faces
        (   
            (8 9 10 11)
        );
    }

    bottom
    {
        type wall;
        faces
        (   
            (0 3 2 1)
        );
    }

    leftWall
    {
        type symmetryPlane;
        faces
        (   
            (2 3 7 6)
            (6 7 11 10)
        );
    }

    rightWall
    {
        type symmetryPlane;
        faces
        (   
            (0 1 5 4)
            (4 5 9 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
