Resources/DigitalWindTunnel/Openfoam_digital_twin_no_building/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          12400;
        startFace       7382800;
    }
    outlet
    {
        type            patch;
        nFaces          12400;
        startFace       7395200;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          20000;
        startFace       7407600;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20000;
        startFace       7427600;
    }
    leftWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24800;
        startFace       7447600;
    }
    rightWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24800;
        startFace       7472400;
    }
)

// ************************************************************************* //
