Resources/DigitalWindTunnel/Openfoam_digital_twin_no_building/0/flm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object flm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 4 -4 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0;
    }

    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform 0;
    }

    bottom
    {
        type fixedValue;
        value uniform 0;
    }

    top
    {
        type    symmetryPlane;
    }
    
    leftWall
    {
        type    symmetryPlane;
    }

    rightWall
    {
        type    symmetryPlane;
    }
}

// ************************************************** *********************** //
